Repository: XianYuLauncher/XianYuLauncher
Catalog: XianYuLauncher/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn, zh_tw

# Shell_Settings
source: Settings
zh_tw: 設定

# DownloadQueuePage_Title.Text
source: Download Queue
zh_tw: 下載佇列

# DownloadQueuePage_Subtitle.Text
source: Current downloads and queued tasks will appear here.
zh_tw: 當前下載任務和排隊任務將在這裡顯示

# DownloadQueuePage_SummaryRunning.Text
source: Active
zh_tw: 執行中

# DownloadQueuePage_SummaryQueued.Text
source: Queued
zh_tw: 排隊中

# DownloadQueuePage_SummaryTotalSpeed.Text
source: Total Speed
zh_tw: 總速度

# DownloadQueuePage_SummaryFailed.Text
source: Failed
zh_tw: 失敗任務

# DownloadQueuePage_EmptyTitle.Text
source: Your download queue is empty
zh_tw: 下載佇列還是空的

# DownloadQueuePage_EmptyDescription.Text
source: New downloads, queued tasks, and recent records will appear here. You can start tasks from version installation, resource downloads, or the mod download page.
zh_tw: 新的下載任務、排隊任務和最近記錄會在這裡出現。你可以從版本安裝、資源下載或 Mod 下載頁發起任務。

# DownloadQueuePage_EmptyActionText.Text
source: Go to Downloads
zh_tw: 前往下載

# DownloadQueuePage_RunningSection.Text
source: Active
zh_tw: 執行中

# DownloadQueuePage_QueuedSection.Text
source: Queued
zh_tw: 排隊中

# DownloadQueuePage_RecentSection.Text
source: Recent Tasks
zh_tw: 近期任務

# DownloadQueuePage_RunningCancelButton.ToolTipService.ToolTip
source: Cancel task
zh_tw: 取消任務

# DownloadQueuePage_QueuedCancelButton.ToolTipService.ToolTip
source: Cancel task
zh_tw: 取消任務

# DownloadQueuePage_RecentRetryButton.ToolTipService.ToolTip
source: Retry task
zh_tw: 重試任務

# DownloadQueue_Status_QueuedWithPosition
source: Queued · #{0}
zh_tw: 排隊中 · 第 {0} 位

# DownloadQueue_Status_Waiting
source: Waiting to download...
zh_tw: 等待下載...

# DownloadQueue_Status_Preparing
source: Preparing download...
zh_tw: 正在準備下載...

# DownloadQueue_Status_Downloading
source: Downloading...
zh_tw: 正在下載...

# DownloadQueue_Status_DownloadingNamed
source: Downloading {0}...
zh_tw: 正在下載 {0}...

# DownloadQueue_Status_DownloadingNamedWithProgress
source: Downloading {0}... {1}
zh_tw: 正在下載 {0}... {1}

# DownloadQueue_Status_Completed
source: Download complete
zh_tw: 下載完成

# DownloadQueue_Status_Failed
source: Download failed
zh_tw: 下載失敗

# DownloadQueue_Status_FailedWithError
source: Download failed: {0}
zh_tw: 下載失敗: {0}

# DownloadQueue_Status_Cancelled
source: Download cancelled
zh_tw: 下載已取消

# DownloadQueue_Status_Generic
source: Download task
zh_tw: 下載任務

# DownloadQueue_Status_DownloadingDependency
source: Downloading dependency: {0}...
zh_tw: 正在下載前置: {0}...

# DownloadQueue_Status_DownloadingDependencyWithProgress
source: Downloading dependency: {0}... {1}
zh_tw: 正在下載前置: {0}... {1}

# DownloadQueue_Status_DownloadingDependencyResource
source: Downloading dependency resource: {0}
zh_tw: 正在下載前置資源: {0}

# DownloadQueue_Status_ExtractingWorldArchive
source: Extracting world archive...
zh_tw: 正在解壓世界存檔...

# DownloadQueue_Status_ExtractingTo
source: Extracting to: {0}
zh_tw: 正在解壓到: {0}

# DownloadQueue_Status_PreparingDependencies
source: Resolving dependencies...
zh_tw: 正在解析前置依賴...

# DownloadQueue_Status_DependenciesReady
source: Dependencies ready, adding to the download queue...
zh_tw: 前置依賴已就緒，正在加入下載佇列...

# DownloadQueue_Status_PreparationFailed
source: Preparation failed: {0}
zh_tw: 準備階段失敗: {0}

# DownloadQueue_Status_DownloadingCount
source: Downloading ({0}/{1})...
zh_tw: 正在下載 ({0}/{1})...

# DownloadQueue_Status_CompletedCount
source: Completed {0}/{1}
zh_tw: 已完成 {0}/{1}

# DownloadQueue_Status_BackgroundDownloading
source: Downloading in background...
zh_tw: 正在後臺下載...

# DownloadQueue_Status_Cancelling
source: Cancelling...
zh_tw: 正在取消...

# DownloadQueue_Status_PreparingModpackInstall
source: Preparing modpack install...
zh_tw: 正在準備整合包安裝...

# DownloadQueue_Status_PreparingModpackUpdate
source: Preparing modpack update...
zh_tw: 正在準備整合包更新...

# DownloadQueue_Status_ModpackExtractingPackage
source: Extracting modpack...
zh_tw: 正在解壓整合包...

# DownloadQueue_Status_ModpackParsingManifest
source: Parsing modpack manifest...
zh_tw: 正在解析整合包資訊...

# DownloadQueue_Status_ModpackDeployingFiles
source: Version download complete, deploying modpack files...
zh_tw: 版本下載完成，正在部署整合包檔案...

# DownloadQueue_Status_ModpackDownloadingFiles
source: Downloading modpack files...
zh_tw: 正在下載整合包檔案...

# DownloadQueue_Status_ModpackUpdating
source: Updating modpack...
zh_tw: 正在更新整合包...

# DownloadQueue_Status_ModpackUpdatingCoreFiles
source: Updating core instance files (Minecraft {0} / {1} {2})...
zh_tw: 正在更新例項核心檔案（Minecraft {0} / {1} {2}）...

# DownloadQueue_Status_ModpackDownloadingCoreVersion
source: Downloading Minecraft {0} and {1} {2}...
zh_tw: 正在下載 Minecraft {0} 和 {1} {2}...

# DownloadQueue_Status_ModpackCleaningFiles
source: Cleaning old modpack files...
zh_tw: 正在清理舊整合包檔案...

# DownloadQueue_Status_ModpackApplyingOverrides
source: Applying modpack override files...
zh_tw: 正在覆蓋整合包配置檔案...

# DownloadQueue_Status_ModpackCopyingOverrides
source: Copying override files...
zh_tw: 正在複製覆蓋檔案...

# DownloadQueue_Status_ModpackFetchingResourceInfo
source: Fetching resource metadata...
zh_tw: 正在獲取資源資訊...

# DownloadQueue_Status_ModpackDownloadingFilesWithCount
source: Downloading modpack files ({0}/{1})...
zh_tw: 正在下載整合包檔案 ({0}/{1})...

# DownloadQueue_Status_ModpackDownloadingPackage
source: Downloading modpack package...
zh_tw: 正在下載整合包...

# DownloadQueue_Status_ModpackCopyingLocalPackage
source: Copying local modpack package...
zh_tw: 正在複製本地整合包檔案...

# DownloadQueue_Status_ModpackInstallCompleted
source: Modpack install completed
zh_tw: 整合包安裝完成

# DownloadQueue_Status_ModpackInstallFailedWithError
source: Modpack install failed: {0}
zh_tw: 整合包安裝失敗: {0}

# DownloadQueue_Status_ModpackInstallCancelled
source: Modpack install cancelled
zh_tw: 整合包安裝已取消

# DownloadQueue_Status_ModpackUpdateCompleted
source: Modpack update completed
zh_tw: 整合包更新完成

# DownloadQueue_Status_ModpackUpdateFailedWithError
source: Modpack update failed: {0}
zh_tw: 整合包更新失敗: {0}

# DownloadQueue_Status_ModpackUpdateCancelled
source: Modpack update cancelled
zh_tw: 整合包更新已取消

# DownloadQueue_Status_ValidatingFile
source: Validating {0}...
zh_tw: 正在校驗 {0}...

# DownloadQueue_Status_ApplyingFileUpdate
source: Replacing {0}...
zh_tw: 正在替換 {0}...

# DownloadQueue_Status_CommunityUpdateProgress
source: Updated {0}/{1}, failed {2}
zh_tw: 已更新 {0}/{1}，失敗 {2}

# DownloadQueue_Status_CommunityUpdateCompleted
source: Batch complete: updated {0}/{1}, failed {2}
zh_tw: 批次完成：已更新 {0}/{1}，失敗 {2}

# DownloadQueue_Status_CommunityUpdateFailed
source: Batch failed: updated {0}/{1}, failed {2}
zh_tw: 批次失敗：已更新 {0}/{1}，失敗 {2}

# DownloadQueue_Status_CommunityUpdateCancelled
source: Batch cancelled: updated {0}/{1}, failed {2}
zh_tw: 批次已取消：已更新 {0}/{1}，失敗 {2}

# DownloadQueue_TaskType_GameInstall
source: Game Install
zh_tw: 遊戲安裝

# DownloadQueue_TaskType_ModDownload
source: Mod Download
zh_tw: Mod 下載

# DownloadQueue_TaskType_ResourcePackDownload
source: Resource Pack Download
zh_tw: 資源包下載

# DownloadQueue_TaskType_ShaderDownload
source: Shader Download
zh_tw: 光影下載

# DownloadQueue_TaskType_DataPackDownload
source: Data Pack Download
zh_tw: 資料包下載

# DownloadQueue_TaskType_WorldDownload
source: World Download
zh_tw: 世界下載

# DownloadQueue_TaskType_ModpackDownload
source: Modpack Download
zh_tw: 整合包下載

# DownloadQueue_TaskType_ModpackInstallFile
source: Modpack File
zh_tw: 整合包檔案

# DownloadQueue_TaskType_ModpackUpdate
source: Modpack Update
zh_tw: 整合包更新

# DownloadQueue_TaskType_ModpackUpdateFile
source: Modpack File Update
zh_tw: 整合包檔案更新

# DownloadQueue_TaskType_CommunityResourceUpdateBatch
source: Community Resource Update
zh_tw: 社群資源更新

# DownloadQueue_TaskType_CommunityResourceUpdateFile
source: Update File
zh_tw: 更新檔案

# DownloadQueue_TaskType_FileDownload
source: File Download
zh_tw: 檔案下載

# DownloadQueue_TaskType_Generic
source: Download Task
zh_tw: 下載任務

# DownloadQueue_DisplayName_CommunityResourceUpdateBatch
source: Community Resource Update · {0}
zh_tw: 社群資源更新 · {0}

# DownloadQueue_DisplayName_FavoriteImport
source: Favorites Import
zh_tw: 收藏夾匯入

# DownloadQueue_DisplayName_Client
source: Client {0}
zh_tw: 客戶端 {0}

# DownloadQueue_DisplayName_Server
source: Server {0}
zh_tw: 服務端 {0}

# DownloadQueue_DisplayName_ModpackInstall
source: Modpack Install · {0}
zh_tw: 整合包安裝 · {0}

# DownloadQueue_DisplayName_ModpackUpdate
source: Modpack Update · {0}
zh_tw: 整合包更新 · {0}

# SettingsPage_Title.Text
source: Settings
zh_cn: 设置
zh_tw: 設定

# SettingsPage_Subtitle.Text
source: Configure launcher settings
zh_cn: 配置启动器设置
zh_tw: 配置啟動器設定

# Settings_BasicTitle.Text
source: Basic Settings
zh_cn: 基础设置
zh_tw: 基礎設定

# Settings_Game.Text
source: Game Settings
zh_cn: 游戏设置
zh_tw: 遊戲設定

# Settings_Theme_Light.Content
source: Light
zh_cn: 浅色
zh_tw: 淺色

# Settings_Theme_Dark.Content
source: Dark
zh_cn: 深色
zh_tw: 深色

# Settings_Theme_Default.Content
source: Follow System
zh_cn: 跟随系统
zh_tw: 跟隨系統

# Settings_WindowMaterialDescription.Text
source: Select window material. Mica effects and custom background cannot be used simultaneously.
zh_cn: 选择窗口材质，云母效果与自定义背景不可同时使用
zh_tw: 選擇視窗材質，雲母效果與自定義背景不可同時使用

# MaterialType_Mica
source: Mica
zh_cn: 云母
zh_tw: 雲母

# MaterialType_MicaAlt
source: Mica Alt
zh_cn: 云母 Alt
zh_tw: 雲母 Alt

# MaterialType_Acrylic
source: Acrylic
zh_cn: 亚克力
zh_tw: 亞克力

# MaterialType_CustomBackground
source: Custom Background
zh_cn: 自定义背景
zh_tw: 自定義背景

# Settings_Language_Chinese.Content
source: Simplified Chinese
zh_cn: 简体中文
zh_tw: 簡體中文

# Settings_LanguageDescription.Text
source: Select app language. Changes will take effect after restarting the app.
zh_cn: 选择应用语言，更改后需要重启应用才能生效
zh_tw: 選擇應用語言，更改後需要重啟應用才能生效

# Settings_LanguageChanged_Title
source: Language Updated
zh_tw: 語言設定已更新

# Settings_LanguageChanged_Content
source: Language settings have been saved successfully. The app needs to restart for changes to take effect. Restart now?
zh_tw: 語言設定已成功儲存，應用將在重啟後生效。是否立即重啟應用？

# Settings_LanguageChanged_RestartNow
source: Restart Now
zh_tw: 立即重啟

# Settings_LanguageChanged_RestartLater
source: Later
zh_tw: 稍後重啟

# Settings_JavaTitle.Text
source: Java Settings
zh_cn: Java设置
zh_tw: Java 設定

# Settings_JavaPath.Text
source: Java Path Settings
zh_cn: Java路径设置
zh_tw: Java 路徑設定

# Settings_InstalledJavaVersions.Text
source: Installed Java Versions
zh_cn: 已安装的Java版本
zh_tw: 已安裝的 Java 版本

# Settings_Add.Content
source: Add
zh_cn: 添加
zh_tw: 新增

# Settings_DownloadJava.Content
source: Download
zh_tw: 下載

# Settings_Refresh.Content
source: Refresh
zh_cn: 刷新
zh_tw: 重新整理

# Settings_JavaSelectionMode_Auto.Content
source: Auto-select Java from list
zh_cn: 自动从列表内选择Java
zh_tw: 自動

# Settings_JavaSelectionMode_Manual.Content
source: Manually select Java
zh_cn: 手动选择Java
zh_tw: 手動

# Settings_Browse.Content
source: Browse...
zh_cn: 浏览...
zh_tw: 瀏覽...

# Settings_Clear.Content
source: Clear
zh_cn: 清除
zh_tw: 清除

# Settings_JavaPathDescription.Text
source: Use the 'Add' button to manually add Java versions to the list, or directly specify the Java path
zh_cn: 使用'添加'按钮手动添加Java版本到列表，或直接指定Java路径
zh_tw: 使用「新增」按鈕手動新增 Java 版本到列表，或直接指定 Java 路徑

# Settings_NetworkTitle.Text
source: Network Download
zh_cn: 网络与下载
zh_tw: 網路與下載

# Settings_SelectDownloadSource.Text
source: Select Download Source
zh_cn: 选择下载源
zh_tw: 選擇下載源

# Settings_DownloadSource_Official.Content
source: Prefer Official Source
zh_cn: 尽量使用官方源
zh_tw: 儘量使用官方源

# Settings_DownloadSource_BMCLAPI.Content
source: Prefer BMCLAPI
zh_cn: 尽量使用BMCLAPI
zh_tw: 儘量使用 BMCLAPI

# Settings_DownloadSourceDescription.Text
source: Selecting a download source can affect the download speed and stability of game resources
zh_cn: 选择下载源可以影响游戏资源的下载速度和稳定性
zh_tw: 選擇下載源可以影響遊戲資源的下載速度和穩定性

# Settings_VersionListSource_Official.Content
source: Prefer Official Source
zh_cn: 尽量使用官方源
zh_tw: 儘量使用官方源

# Settings_VersionListSource_BMCLAPI.Content
source: Prefer BMCLAPI
zh_cn: 尽量使用BMCLAPI
zh_tw: 儘量使用 BMCLAPI

# Settings_VersionListSourceDescription.Text
source: Selecting a version list source can affect the speed and stability of game version list retrieval
zh_cn: 选择版本列表源可以影响游戏版本列表的获取速度和稳定性
zh_tw: 選擇版本列表源可以影響遊戲版本列表的獲取速度和穩定性

# Settings_VersionDownload.Text
source: Download Settings
zh_cn: 下载设置
zh_tw: 下載設定

# Settings_DownloadDependenciesDescription.Text
source: Auto-download required dependency mods
zh_cn: 自动下载所需的前置Mod
zh_tw: 自動下載所需的前置 Mod

# Settings_HideSnapshotVersionsDescription.Text
source: Hide snapshots, pre-releases and release candidates
zh_cn: 隐藏Mod下载页快照、预发布版和候选版本
zh_tw: 隱藏 Mod 下載頁快照、預釋出版和候選版本

# Settings_DownloadThreadCountDescription.Text
source: Number of concurrent threads for downloading resources.
zh_cn: 同时下载资源文件的线程数量，数值越大下载越快，但可能占用更多系统资源
zh_tw: 同時下載資原始檔的執行緒數量，數值越大下載越快，但可能佔用更多系統資源

# Settings_AboutTitle.Text
source: About
zh_cn: 关于
zh_tw: 關於

# Settings_Disclaimer.Text
source: XianYuLauncher is an unofficial Minecraft launcher and has no affiliation or official cooperation with Mojang Studios, Microsoft, or their mainland China agents.
zh_cn: XianYuLauncher 是一个非官方的 Minecraft 启动器，与 Mojang Studios、Microsoft 及其中中国大陆代理公司无任何从属关系或官方合作关联。
zh_tw: XianYuLauncher 是一個非官方的 Minecraft 啟動器，與 Mojang Studios、Microsoft 及其中中國大陸代理公司無任何從屬關係或官方合作關聯。

# TutorialPage_Title.Text
source: Get Started
zh_tw: 開始

# TutorialPage_Subtitle.Text
source: Complete the setup to get going
zh_tw: 完成以下設定以開始使用

# TutorialPage_StepText.Text
source: Step 1/3
zh_cn: 步骤 1/3
zh_tw: 步驟 1/3

# TutorialPage_MinecraftPathTitle.Text
source: Minecraft Path
zh_cn: Minecraft 路径
zh_tw: Minecraft 路徑

# TutorialPage_MinecraftPathTextBox.PlaceholderText
source: Please select Minecraft game directory
zh_cn: 请选择Minecraft游戏目录
zh_tw: 請選擇 Minecraft 遊戲目錄

# TutorialPage_MinecraftPathDescription.Text
source: Minecraft game directory, containing versions, saves, etc.
zh_cn: Minecraft游戏目录，包含versions、saves等文件夹
zh_tw: Minecraft 遊戲目錄，包含 versions、saves 等資料夾

# TutorialPage_JavaSettingsTitle.Text
source: Java Settings
zh_cn: Java路径设置
zh_tw: Java 路徑設定

# TutorialPage_JavaSelectionMode.Text
source: Java Selection Mode
zh_cn: Java选择方式
zh_tw: Java 選擇方式

# TutorialPage_JavaPathTitle.Text
source: Java Path
zh_cn: Java路径
zh_tw: Java 路徑

# TutorialPage_JavaPathTextBox.PlaceholderText
source: Please select Java executable path
zh_cn: 请选择Java可执行文件路径
zh_tw: 請選擇 Java 可執行檔案路徑

# TutorialPage_BrowseJavaButton.Content
source: Browse...
zh_cn: 浏览...
zh_tw: 瀏覽...

# TutorialPage_ClearJavaButton.Content
source: Clear
zh_cn: 清除
zh_tw: 清除

# TutorialPage_JavaPathDescription.Text
source: Use 'Add' button to manually add Java versions to the list, or directly specify Java path
zh_cn: 使用'添加'按钮手动添加Java版本到列表，或直接指定Java路径
zh_tw: 使用「新增」按鈕手動新增 Java 版本到列表，或直接指定 Java 路徑

# TutorialPage_LoginTypeTitle.Text
source: Login Type
zh_cn: 登录方式
zh_tw: 登入方式

# TutorialPage_MicrosoftLoginRadio.Content
source: Microsoft Login
zh_cn: 微软登录
zh_tw: 微軟登入

# TutorialPage_OfflineLoginRadio.Content
source: Offline Login
zh_cn: 离线登录
zh_tw: 離線登入

# TutorialPage_LoginButtonText.Text
source: Login
zh_cn: 登录
zh_tw: 登入

# TutorialPage_LoginRequiredDialog_Title
source: Login Required
zh_cn: 登录要求
zh_tw: 登入要求

# TutorialPage_LoginRequiredDialog_Content
source: You are not logged into your Microsoft account!
zh_cn: 您未登录微软账户!
zh_tw: 您未登入微軟賬戶!

# TutorialPage_OKButtonText
source: OK
zh_cn: 确定
zh_tw: 確定

# TutorialPage_LoginFailedDialog_Title
source: Login Failed
zh_cn: 登录失败
zh_tw: 登入失敗

# TutorialPage_PurchaseMinecraftDialog_Title
source: Purchase Minecraft
zh_cn: 购买Minecraft
zh_tw: 購買 Minecraft

# TutorialPage_PurchaseMinecraftDialog_Content
source: Your Microsoft account has not purchased Minecraft yet. Please purchase the game first.
zh_cn: 您的微软账户尚未购买Minecraft，请先购买游戏。
zh_tw: 您的微軟賬戶尚未購買 Minecraft，請先購買遊戲。

# TutorialPage_PurchaseButtonText
source: Go to Purchase
zh_cn: 前往购买
zh_tw: 前往購買

# TutorialPage_CancelButtonText
source: Cancel
zh_cn: 取消
zh_tw: 取消

# TutorialPage_CannotOpenLinkDialog_Title
source: Cannot Open Link
zh_cn: 无法打开链接
zh_tw: 無法開啟連結

# TutorialPage_CannotOpenLinkDialog_Content
source: Unable to open the purchase link. Please visit the website manually.
zh_cn: 无法打开购买链接，请手动访问该网址。
zh_tw: 無法開啟購買連結，請手動訪問該網址。

# TutorialPage_StepPrefixText
source: Step
zh_cn: 步骤
zh_tw: 步驟

# TutorialPage_LoginStatus_GettingCode
source: Getting login code...
zh_cn: 正在获取登录代码...
zh_tw: 正在獲取登入程式碼...

# TutorialPage_LoginStatus_VisitUrl
source: Please visit
zh_cn: 请在浏览器中访问
zh_tw: 請在瀏覽器中訪問

# TutorialPage_LoginStatus_EnterCode
source: in your browser and enter code
zh_cn: 输入代码
zh_tw: 輸入程式碼

# TutorialPage_LoginStatus_Success
source: Login successful
zh_cn: 登录成功
zh_tw: 登入成功

# LaunchPage_MicrosoftAccountRenewingText
source: Microsoft account renewing...
zh_cn: 正在进行微软账户续签...
zh_tw: 正在進行微軟賬戶續簽...

# LaunchPage_MicrosoftAccountRenewedText
source: Microsoft account renewed successfully...
zh_cn: 微软账户续签成功...
zh_tw: 微軟賬戶續簽成功...

# LaunchPage_PleaseSelectVersionText
source: Please select a version first
zh_cn: 请先选择一个版本
zh_tw: 請先選擇一個版本

# LaunchPage_DefaultTitle
source: Launch Game
zh_cn: 启动游戏
zh_tw: 啟動遊戲

# LaunchPage_SelectVersionText
source: Select a game version
zh_cn: 请选择游戏版本
zh_tw: 請選擇遊戲版本

# LaunchPage_SelectCharacterText
source: Select a character
zh_cn: 请选择游戏角色
zh_tw: 請選擇遊戲賬戶

# Settings_AddedGameDirectories
source: Added Game Directories
zh_cn: 已添加的游戏目录
zh_tw: 已新增的遊戲目錄

# Settings_AddDirectory.Content
source: Add Directory
zh_cn: 添加目录
zh_tw: 新增目錄

# Settings_RemoveDirectory.Content
source: Remove
zh_cn: 删除
zh_tw: 刪除

# Settings_DefaultGameDirectory
source: Default Game Directory
zh_cn: 默认游戏目录
zh_tw: 預設遊戲目錄

# Settings_GameDirectoryFormat
source: Game Directory {0}
zh_cn: 游戏目录 {0}
zh_tw: 遊戲目錄 {0}

# Settings_Hint
source: Hint
zh_cn: 提示
zh_tw: 提示

# Settings_DirectoryAlreadyExists
source: This game directory already exists in the list
zh_cn: 该游戏目录已存在于列表中
zh_tw: 該遊戲目錄已存在於列表中

# Settings_OK
source: OK
zh_cn: 确定
zh_tw: 確定

# LaunchPage_StartingGameText
source: Starting game...
zh_cn: 正在启动游戏...
zh_tw: 正在啟動遊戲...

# LaunchPage_PreparingGameFilesText
source: Preparing game files...
zh_cn: 正在准备游戏文件...
zh_tw: 正在準備遊戲檔案...

# LaunchPage_PreparingGameFilesProgressText
source: Preparing game files...
zh_cn: 正在准备游戏文件...
zh_tw: 正在準備遊戲檔案...

# LaunchPage_DownloadingText
source: Downloading
zh_cn: 正在下载
zh_tw: 正在下載

# LaunchPage_PreparingGameFilesFailedText
source: Failed to prepare game files
zh_cn: 准备游戏文件失败
zh_tw: 準備遊戲檔案失敗

# LaunchPage_InnerErrorText
source: Inner error
zh_cn: 内部错误
zh_tw: 內部錯誤

# LaunchPage_FailedToGetMainClassText
source: Failed to get main class
zh_cn: 无法获取游戏主类
zh_tw: 無法獲取遊戲主類

# LaunchPage_BuildingClasspathText
source: Building classpath...
zh_cn: 正在构建Classpath...
zh_tw: 正在構建 Classpath...

# LaunchPage_GameCommandExecutedText
source: Game launch command executed, command line window opened!
zh_cn: 游戏启动命令已执行，命令行窗口已打开！
zh_tw: 遊戲啟動命令已執行，命令列視窗已開啟！

# LaunchPage_GameStartedSuccessfullyText
source: Started successfully!
zh_cn: 启动成功！
zh_tw: 啟動成功！

# Settings_ThanksToTeam.Text
source: Thanks to all the members who contributed
zh_cn: 感谢所有作出贡献的成员
zh_tw: 感謝所有作出貢獻的成員

# Settings_XianYuSupportText
source: Developer
zh_cn: 开发者
zh_tw: 開發者

# Settings_BmclapiSupportText
source: Provided BMCLAPI
zh_cn: 提供了BMCLAPI
zh_tw: 提供了 BMCLAPI

# Settings_PersonalizationTitle.Text
source: Personalization
zh_cn: 个性化
zh_tw: 個性化

# Settings_MinecraftPathDescription.Text
source: Minecraft game directory, containing versions, saves, etc.
zh_cn: Minecraft游戏目录，包含versions、saves等文件夹
zh_tw: Minecraft 遊戲目錄，包含 versions、saves 等資料夾

# Settings_VersionIsolationDescription.Text
source: When enabled, each Minecraft version will use an independent game directory (.minecraft/versions/{version ID})
zh_cn: 开启后，每个Minecraft版本将使用独立的游戏目录(.minecraft/versions/{版本ID})
zh_tw: 開啟後，每個 Minecraft 版本將使用獨立的遊戲目錄（.minecraft/versions/{版本 ID}）

# LaunchPage_Subtitle.Text
source: Minecraft Launcher
zh_cn: Minecraft 启动器
zh_tw: Minecraft 啟動器

# ResourceDownloadPage_DatapackTabHeader.Text
source: Datapacks
zh_cn: 数据包下载
zh_tw: 資料包下載

# ResourceDownloadPage_ModpackTabHeader.Text
source: Modpacks
zh_cn: 整合包下载
zh_tw: 整合包下載

# ResourceDownloadPage_WorldTabHeader.Text
source: Worlds
zh_cn: 世界下载
zh_tw: 世界下載

# ResourceDownloadPage_WorldSearchBox.PlaceholderText
source: Search worlds...
zh_cn: 搜索世界...
zh_tw: 搜尋世界...

# ResourceDownloadPage_WorldVersionComboBox.PlaceholderText
source: Version
zh_cn: 版本
zh_tw: 版本

# ResourceDownloadPage_WorldCategoryComboBox.PlaceholderText
source: All Categories
zh_cn: 所有类别
zh_tw: 所有類別

# LaunchPage_VersionSelection.Text
source: Select Minecraft Version
zh_cn: 选择Minecraft版本
zh_tw: 選擇 Minecraft 版本

# LaunchPage_SelectVersionPlaceholder.PlaceholderText
source: Please select an installed version
zh_cn: 请选择已安装的版本
zh_tw: 請選擇已安裝的版本

# LaunchPage_InstalledVersionsText
source: Installed Versions
zh_cn: 已添加版本
zh_tw: 已新增版本

# LaunchPage_AddVersion.Text
source: Add Version
zh_cn: 添加版本
zh_tw: 新增版本

# LaunchPage_RefreshVersions.Text
source: Refresh Version List
zh_cn: 刷新版本列表
zh_tw: 重新整理版本列表

# LaunchPage_RefreshVersionsTooltip.ToolTipService.ToolTip
source: Refresh version list
zh_cn: 刷新版本列表
zh_tw: 重新整理版本列表

# LaunchPage_LaunchGame.Content
source: Launch Game
zh_cn: 启动游戏
zh_tw: 啟動遊戲

# LaunchPage_SuccessTitle.Title
source: Game Launch Success
zh_cn: 游戏启动成功
zh_tw: 遊戲啟動成功

# LaunchPage_ViewLogsButton.ToolTipService.ToolTip
source: View Logs
zh_cn: 查看日志
zh_tw: 檢視日誌

# Settings_ContributorsHeader.Description
source: Thanks to all contributors
zh_tw: 感謝所有作出貢獻的成員

# Settings_Telemetry.Header
source: Allow sending anonymous diagnostic data
zh_tw: 允許傳送匿名診斷資料

# Settings_Telemetry.Description
source: Help improve the launcher by collecting only game version, performance, and launch result data.
zh_tw: 幫助改進啟動器，僅收集啟動器開啟與首次使用等匿名統計，不包含遊戲版本或執行日誌。

# Settings_InstallDevChannel.Content
source: Install Dev Channel Version
zh_tw: 安裝 Dev 通道版本

# SettingsPage_EulaLink.Content
source: EULA
zh_tw: 終端使用者協議

# Common_ErrorTitle
source: Error
zh_cn: 错误
zh_tw: 錯誤

# Common_OKButton
source: OK
zh_cn: 确定
zh_tw: 確定

# SettingsPage_PrivacyPolicyLink.Content
source: Privacy Policy
zh_tw: 隱私協議

# ResourceDownloadPage_PageTitle.Text
source: Resource Download
zh_cn: 资源下载
zh_tw: 資源下載

# ResourceDownloadPage_PageSubtitle.Text
source: Download and manage Minecraft resources
zh_cn: 下载和管理Minecraft资源
zh_tw: 下載和管理 Minecraft 資源

# ResourceDownloadPage_VersionTabHeader.Text
source: Versions
zh_cn: 版本下载
zh_tw: 版本下載

# ResourceDownloadPage_ModTabHeader.Text
source: Mods
zh_cn: Mod下载
zh_tw: Mod 下載

# ResourceDownloadPage_ShaderPackTabHeader.Text
source: Shaders
zh_cn: 光影下载
zh_tw: 光影下載

# ResourceDownloadPage_ResourcePackTabHeader.Text
source: Resourcepacks
zh_cn: 资源包下载
zh_tw: 資源包下載

# ResourceDownloadPage_LatestRelease.Text
source: Latest Release
zh_cn: 最新正式版
zh_tw: 最新正式版

# ResourceDownloadPage_LatestSnapshot.Text
source: Latest Snapshot
zh_cn: 最新快照版
zh_tw: 最新快照版

# ResourceDownloadPage_DownloadButton.Content
source: Download
zh_cn: 下载
zh_tw: 下載

# ResourceDownloadPage_VersionSearchBox.PlaceholderText
source: Search versions...
zh_cn: 搜索版本...
zh_tw: 搜尋版本...

# ResourceDownloadPage_VersionTypeComboBox.PlaceholderText
source: Filter
zh_cn: 筛选
zh_tw: 篩選

# ResourceDownloadPage_UnifiedFilterLabel.Text
source: Filter
zh_tw: 篩選

# ResourceDownloadPage_AllVersionTypes.Content
source: All
zh_cn: 全部
zh_tw: 全部

# ResourceDownloadPage_ReleaseVersionType.Content
source: Release
zh_cn: 正式版
zh_tw: 正式版

# ResourceDownloadPage_SnapshotVersionType.Content
source: Snapshot
zh_cn: 快照版
zh_tw: 快照版

# ResourceDownloadPage_OldVersionType.Content
source: Old Versions
zh_cn: 旧版
zh_tw: 舊版

# ResourceDownloadPage_LoaderComboBox.PlaceholderText
source: Loader
zh_cn: 加载器
zh_tw: 載入器

# ResourceDownloadPage_AllLoaders.Content
source: Loader
zh_cn: 加载器
zh_tw: 載入器

# ResourceDownloadPage_VersionComboBox.PlaceholderText
source: Version
zh_cn: 版本
zh_tw: 版本

# ResourceDownloadPage_ModCategoryComboBox.PlaceholderText
source: Categories
zh_cn: 类别
zh_tw: 類別

# ResourceDownloadPage_AllCategories.Content
source: Categories
zh_cn: 类别
zh_tw: 類別

# ResourceDownloadPage_AdventureCategory.Content
source: Adventure
zh_cn: 冒险
zh_tw: 冒險
